minutes=int(input('Будь ласка, введіть скільки хвилин тривали Ваші розмови з абонентами інших мобільних операторів: '))
remaining_minutes_1= 50 - minutes #вибачте, такого не було в умові завдання, але було цікаво зробити
remaining_minutes_2= 100 - minutes
limit_2_1=minutes - 100 
limit_2_2=limit_2_1 * 2

if (minutes > -1) and (minutes < 51): #за умови: навіть якщо користувач не використає жодної хвилини, то тарифний план все рівно підключений та має бути оплачений
    print('Вартість Вашого тарифу складає 100 гривень')
    print('У Вас залишилося ще', remaining_minutes_1, 'хвилин')
elif (minutes > 50) and (minutes < 101):
    print('Відбулося перевищення ліміту')
    print('Вам надалися додаткові 50 хв до кінця місяця за 50 гривень')
    print('Загальна вартість складає 150 гривень')
    print('У Вас залишилося ще', remaining_minutes_2, 'хвилин у новому ліміті')
elif (minutes > 100):
    print('Відбулося друге перевищення ліміту')
    print('Ви сплачуватимете 2 гривні за кожну додаткову хвилину')
    print('Загальна вартість складає', limit_2_2, 'гривень')
else: 
    print('Сталася помилка. Будь ласка, введіть додатнє число')


